stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_usart.h
  if (Direction == LL_USART_DMA_REG_DATA_TRANSMIT)
  {
    /* return address of TDR register */
    data_reg_addr = (uint32_t) &(USARTx->TDR);
  }
  else
  {
    /* return address of RDR register */
    data_reg_addr = (uint32_t) &(USARTx->RDR);
  }

  return data_reg_addr;
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Data_Management Data_Management
  * @{
  */

/**
  * @brief  Read Receiver Data register (Receive Data value, 8 bits)
  * @rmtoll RDR          RDR           LL_USART_ReceiveData8
  * @param  USARTx USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_USART_ReceiveData8(const USART_TypeDef *USARTx)
{
  return (uint8_t)(READ_BIT(USARTx->RDR, USART_RDR_RDR) & 0xFFU);
}

/**
  * @brief  Read Receiver Data register (Receive Data value, 9 bits)
  * @rmtoll RDR          RDR           LL_USART_ReceiveData9
  * @param  USARTx USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE uint16_t LL_USART_ReceiveData9(const USART_TypeDef *USARTx)
{
  return (uint16_t)(READ_BIT(USARTx->RDR, USART_RDR_RDR));
}

/**
  * @brief  Write in Transmitter Data Register (Transmit Data value, 8 bits)
  * @rmtoll TDR          TDR           LL_USART_TransmitData8
  * @param  USARTx USART Instance
  * @param  Value between Min_Data=0x00 and Max_Data=0xFF
  * @retval None
  */
__STATIC_INLINE void LL_USART_TransmitData8(USART_TypeDef *USARTx, uint8_t Value)
{
  USARTx->TDR = Value;
}

/**
  * @brief  Write in Transmitter Data Register (Transmit Data value, 9 bits)
  * @rmtoll TDR          TDR           LL_USART_TransmitData9
  * @param  USARTx USART Instance
  * @param  Value between Min_Data=0x00 and Max_Data=0x1FF
  * @retval None
  */
__STATIC_INLINE void LL_USART_TransmitData9(USART_TypeDef *USARTx, uint16_t Value)
{
  USARTx->TDR = (uint16_t)(Value & 0x1FFUL);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Execution Execution
  * @{
  */

/**
  * @brief  Request an Automatic Baud Rate measurement on next received data frame
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(USARTx) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the USARTx instance.
  * @rmtoll RQR          ABRRQ         LL_USART_RequestAutoBaudRate
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_RequestAutoBaudRate(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->RQR, (uint16_t)USART_RQR_ABRRQ);
}

/**
  * @brief  Request Break sending
  * @rmtoll RQR          SBKRQ         LL_USART_RequestBreakSending
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_RequestBreakSending(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->RQR, (uint16_t)USART_RQR_SBKRQ);
}

/**
  * @brief  Put USART in mute mode and set the RWU flag
  * @rmtoll RQR          MMRQ          LL_USART_RequestEnterMuteMode
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_RequestEnterMuteMode(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->RQR, (uint16_t)USART_RQR_MMRQ);
}

/**
  * @brief  Request a Receive Data and FIFO flush
  * @note   Macro IS_UART_FIFO_INSTANCE(USARTx) can be used to check whether or not
  *         FIFO mode feature is supported by the USARTx instance.
  * @note   Allows to discard the received data without reading them, and avoid an overrun
  *         condition.
  * @rmtoll RQR          RXFRQ         LL_USART_RequestRxDataFlush
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_RequestRxDataFlush(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->RQR, (uint16_t)USART_RQR_RXFRQ);
}

/**
  * @brief  Request a Transmit data and FIFO flush
  * @note   Macro IS_UART_FIFO_INSTANCE(USARTx) can be used to check whether or not
  *         FIFO mode feature is supported by the USARTx instance.
  * @rmtoll RQR          TXFRQ         LL_USART_RequestTxDataFlush
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_RequestTxDataFlush(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->RQR, (uint16_t)USART_RQR_TXFRQ);
}

/**
  * @}
  */

/** @defgroup USART_LL_Autonomous_Mode Configuration functions related to Autonomous mode feature
  * @{
  */

/**
  * @brief  Enable Selected Trigger
  * @rmtoll AUTOCR          TRIGEN          LL_USART_Enable_SelectedTrigger
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_Enable_SelectedTrigger(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->AUTOCR, USART_AUTOCR_TRIGEN);
}

/**
  * @brief  Disable Selected Trigger
  * @rmtoll AUTOCR          TRIGEN          LL_USART_Disable_SelectedTrigger
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_Disable_SelectedTrigger(USART_TypeDef *USARTx)
{
  CLEAR_BIT(USARTx->AUTOCR, USART_AUTOCR_TRIGEN);
}

/**
  * @brief  Indicate if Selected Trigger is disabled or enabled
  * @rmtoll AUTOCR          TRIGEN          LL_USART_IsEnabled_SelectedTrigger
  * @param  USARTx USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabled_SelectedTrigger(const USART_TypeDef *USARTx)
{
  return ((READ_BIT(USARTx->AUTOCR, USART_AUTOCR_TRIGEN) == (USART_AUTOCR_TRIGEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Autonomous Send Idle Frame feature
  * @rmtoll AUTOCR          IDLEDIS          LL_USART_Enable_AutonomousSendIdleFrame
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_Enable_AutonomousSendIdleFrame(USART_TypeDef *USARTx)
{
  CLEAR_BIT(USARTx->AUTOCR, USART_AUTOCR_IDLEDIS);
}

/**
  * @brief  Disable Autonomous Send Idle Frame feature
  * @rmtoll AUTOCR          IDLEDIS          LL_USART_Disable_AutonomousSendIdleFrame
  * @param  USARTx USART Instance
  * @retval None
  */
__STATIC_INLINE void LL_USART_Disable_AutonomousSendIdleFrame(USART_TypeDef *USARTx)
{
  SET_BIT(USARTx->AUTOCR, USART_AUTOCR_IDLEDIS);
}

/**
  * @brief  Indicate if Autonomous send Idle Frame feature is disabled or enabled
  * @rmtoll AUTOCR          IDLEDIS          LL_USART_IsEnabled_AutonomousSendIdleFrame
  * @param  USARTx USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabled_AutonomousSendIdleFrame(const USART_TypeDef *USARTx)
{
  return ((READ_BIT(USARTx->AUTOCR, USART_AUTOCR_IDLEDIS) == (USART_AUTOCR_IDLEDIS)) ? 0UL : 1UL);
}

/**
  * @brief  Configure the Number of transferred data in bytes
  * @rmtoll AUTOCR        TDN     LL_USART_SetNbTxData
  * @param  USARTx USART Instance
  * @param  Nbdata This parameter can be a value between 0 and 0xFFFF
  * @retval None
  */
__STATIC_INLINE void LL_USART_SetNbTxData(USART_TypeDef *USARTx, uint32_t Nbdata)
{
  MODIFY_REG(USARTx->AUTOCR, USART_AUTOCR_TDN, (uint16_t)Nbdata);
}

/**
  * @brief  Retrieve the Number of transferred data in bytes
  * @rmtoll AUTOCR        TDN     LL_USART_GetNbTxData
  * @param  USARTx USART Instance
  * @retval Returned value can be a value between 0 and 0xFFFF
  */
__STATIC_INLINE uint32_t LL_USART_GetNbTxData(const USART_TypeDef *USARTx)
{
  return (uint32_t)(READ_BIT(USARTx->AUTOCR, USART_AUTOCR_TDN));
}

/**
  * @brief  Set the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_USART_SetTriggerPolarity
  * @param  USARTx USART Instance
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_USART_TRIG_POLARITY_RISING
  *         @arg @ref LL_USART_TRIG_POLARITY_FALLING
  * @retval None
  */
__STATIC_INLINE void LL_USART_SetTriggerPolarity(USART_TypeDef *USARTx, uint32_t Polarity)
{
  MODIFY_REG(USARTx->AUTOCR, USART_AUTOCR_TRIGPOL, Polarity);
}

/**
  * @brief  Get the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_USART_GetTriggerPolarity
  * @param  USARTx USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_TRIG_POLARITY_RISING
  *         @arg @ref LL_USART_TRIG_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_USART_GetTriggerPolarity(const USART_TypeDef *USARTx)
{
  return (uint32_t)(READ_BIT(USARTx->AUTOCR, USART_AUTOCR_TRIGPOL));
}

/**
  * @brief  Set the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_USART_SetSelectedTrigger
  * @param  USARTx USART Instance
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref  LL_USART_GPDMA1_CH0_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH1_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH2_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH3_TCF_TRG
  *         @arg @ref  LL_USART_EXTI_LINE6_TRG
  *         @arg @ref  LL_USART_EXTI_LINE9_TRG
  *         @arg @ref  LL_USART_LPTIM1_OUT_TRG
  *         @arg @ref  LL_USART_LPTIM2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_COMP1_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_COMP2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_RTC_ALRA_TRG
  *         @arg @ref  LL_USART_RTC_WUT_TRG
  * @retval None
  */
__STATIC_INLINE void LL_USART_SetSelectedTrigger(USART_TypeDef *USARTx, uint32_t Trigger)
{
  MODIFY_REG(USARTx->AUTOCR, USART_AUTOCR_TRIGSEL, (Trigger << USART_AUTOCR_TRIGSEL_Pos));
}

/**
  * @brief  Get the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_USART_GetSelectedTrigger
  * @param  USARTx USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref  LL_USART_GPDMA1_CH0_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH1_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH2_TCF_TRG
  *         @arg @ref  LL_USART_GPDMA1_CH3_TCF_TRG
  *         @arg @ref  LL_USART_EXTI_LINE6_TRG
  *         @arg @ref  LL_USART_EXTI_LINE9_TRG
  *         @arg @ref  LL_USART_LPTIM1_OUT_TRG
  *         @arg @ref  LL_USART_LPTIM2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_COMP1_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_COMP2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_USART_RTC_ALRA_TRG
  *         @arg @ref  LL_USART_RTC_WUT_TRG
  */
__STATIC_INLINE uint32_t LL_USART_GetSelectedTrigger(const USART_TypeDef *USARTx)
{
  return (uint32_t)((READ_BIT(USARTx->AUTOCR, USART_AUTOCR_TRIGSEL) >> USART_AUTOCR_TRIGSEL_Pos));
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup USART_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_USART_DeInit(const USART_TypeDef *USARTx);
ErrorStatus LL_USART_Init(USART_TypeDef *USARTx, const LL_USART_InitTypeDef *USART_InitStruct);
void        LL_USART_StructInit(LL_USART_InitTypeDef *USART_InitStruct);
ErrorStatus LL_USART_ClockInit(USART_TypeDef *USARTx, const LL_USART_ClockInitTypeDef *USART_ClockInitStruct);
void        LL_USART_ClockStructInit(LL_USART_ClockInitTypeDef *USART_ClockInitStruct);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USART1 || USART2 || USART3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WBAxx_LL_USART_H */
